DataProcessors/Приемка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>Приемка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСкладов</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ЗаказыПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикам</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаСкладов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСкладов</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПриходныйОрдерНаТовары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриходныйОрдерНаТовары</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРознице</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПолучениюНаСклады</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыПолученные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриходныйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезПраваПродажи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПеремещения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйДоп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьТТН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияМест</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>флТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.im_ПоставщикиИнтернетМагазина</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратнаяТара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРезерва</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
								<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/Приемка/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура РаспоряженияПриАктивизацииСтроки(Элемент)
	Попытка
		ДокументСсылка = Элемент.ТекущиеДанные.ЗаказПоставщику;
	Исключение
		ДокументСсылка = Документы.ЗаявкаНаРасходованиеСредств.ПустаяСсылка();	
	КонецПопытки;
	ОбновитьТоварыКПриемке(ДокументСсылка);
	Ордера.Параметры.УстановитьЗначениеПараметра("ДокументОснование", ДокументСсылка);
КонецПроцедуры

&НаСервере
Процедура ОбновитьТоварыКПриемке(Документ)
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МАКСИМУМ(ЗаказыПоставщикамОстаткиИОбороты.КоличествоПриход) КАК НеобходимоПринять,
	               |	ЗаказыПоставщикамОстаткиИОбороты.Номенклатура,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Принято
	               |ПОМЕСТИТЬ Данные
	               |ИЗ
	               |	РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты(, , , , ЗаказПоставщику = &ЗаказПоставщику) КАК ЗаказыПоставщикамОстаткиИОбороты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ПриходныйОрдерНаТоварыТовары.Ссылка КАК Ссылка,
	               |			ПриходныйОрдерНаТоварыТовары.НомерСтроки КАК НомерСтроки,
	               |			ПриходныйОрдерНаТоварыТовары.Номенклатура КАК Номенклатура,
	               |			ПриходныйОрдерНаТоварыТовары.КоличествоМест КАК КоличествоМест,
	               |			ПриходныйОрдерНаТоварыТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	               |			ПриходныйОрдерНаТоварыТовары.ЕдиницаИзмеренияМест КАК ЕдиницаИзмеренияМест,
	               |			ПриходныйОрдерНаТоварыТовары.Коэффициент КАК Коэффициент,
	               |			ПриходныйОрдерНаТоварыТовары.Количество КАК Количество,
	               |			ПриходныйОрдерНаТоварыТовары.СерияНоменклатуры КАК СерияНоменклатуры,
	               |			ПриходныйОрдерНаТоварыТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |			ПриходныйОрдерНаТоварыТовары.ДокументРезерва КАК ДокументРезерва,
	               |			ПриходныйОрдерНаТоварыТовары.Качество КАК Качество
	               |		ИЗ
	               |			Документ.ПриходныйОрдерНаТовары.Товары КАК ПриходныйОрдерНаТоварыТовары
	               |		ГДЕ
	               |			ПриходныйОрдерНаТоварыТовары.Ссылка.Проведен
	               |			И ПриходныйОрдерНаТоварыТовары.Ссылка.ДокументОснования = &ЗаказПоставщику) КАК ВложенныйЗапрос
	               |		ПО ЗаказыПоставщикамОстаткиИОбороты.ЗаказПоставщику = ВложенныйЗапрос.Ссылка.ДокументОснования
	               |			И ЗаказыПоставщикамОстаткиИОбороты.Номенклатура = ВложенныйЗапрос.Номенклатура
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗаказыПоставщикамОстаткиИОбороты.Номенклатура
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Данные.НеобходимоПринять,
	               |	Данные.Номенклатура,
	               |	Данные.НеобходимоПринять - ЕСТЬNULL(Данные.Принято, 0) КАК ОстатокКПриемке,
	               |	Данные.Принято
	               |ИЗ
	               |	Данные КАК Данные";
	
	Запрос.УстановитьПараметр("ЗаказПоставщику",Документ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
	СостояниеПриемки.Загрузить(РезультатЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	Распоряжения.Параметры.УстановитьЗначениеПараметра("Склад", Объект.Склад);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Распоряжения.Параметры.УстановитьЗначениеПараметра("Склад", Объект.Склад);
	Ордера.Параметры.УстановитьЗначениеПараметра("ДокументОснование", Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 Объект.Склад = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ПараметрыСеанса.ТекущийПользователь,"ОсновнойСклад");
	
КонецПроцедуры


&НаСервере
Функция СоздатьОрдерНаСервере(ЗаказПоставщику)
	Об			         = Документы.ПриходныйОрдерНаТовары.СоздатьДокумент();
	об.Склад 		     = Объект.Склад;
	об.ДокументОснования = ЗаказПоставщику;
	об.Ответственный 	 = ПараметрыСеанса.ТекущийПользователь;
	об.Организация		 = ЗаказПоставщику.организация;
	об.Контрагент 		 = ЗаказПоставщику.Контрагент;
	
	
	Возврат об;

КонецФункции


&НаКлиенте
Процедура СоздатьОрдер(Команда)
Попытка	
	Об = СоздатьОрдерНаСервере(Элементы.Распоряжения.ТекущиеДанные.ЗаказПоставщику); // Заполняем документ на сервере
	об.получитьФорму().Открыть();
Исключение
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура РаспоряженияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Попытка
		ДокументСсылка = Элемент.ТекущиеДанные.ЗаказПоставщику;
		ОткрытьЗначение(ДокументСсылка);
	Исключение
		ДокументСсылка = Документы.ЗаявкаНаРасходованиеСредств.ПустаяСсылка();	
	КонецПопытки;
	

КонецПроцедуры


&НаСервере
Процедура ОбновитьНаСервере()
	// Вставити вміст обробника.
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	
	Попытка
		ДокументСсылка = Элементы.Распоряжения.ТекущиеДанные.ЗаказПоставщику;
	Исключение
		ДокументСсылка = Документы.ЗаявкаНаРасходованиеСредств.ПустаяСсылка();	
	КонецПопытки;
	ОбновитьТоварыКПриемке(ДокументСсылка);
	Ордера.Параметры.УстановитьЗначениеПараметра("ДокументОснование", ДокументСсылка);

КонецПроцедуры
